# Francesco's
# Stack
#
# All the things I need to operate my digital self
# Categorized into different areas of interest


# ---- System ----
# Formulae
brew "bat" # Preview files in terminal
brew "eza" # Lists files in terminal
brew "ffmpeg" # File conversion
brew "fzf" # Fuzzy-find files
brew "gnupg" # For encrypting secrets. Used for secret management with yadm.
brew "tmux"
brew "tree"
brew "wget"
brew "yadm" # Dotfiles Manager of choice
brew "zip"
brew "zoxide"

# Casks
cask "amethyst" # Window Manager of choice
cask "waterfox" # Browser of choice
cask "firefox@developer-edition" # Alternative for web dev
cask "google-chrome" # Alternative for web dev
cask "logitech-options"
cask "stats"
cask "surfshark"

# Apps
mas "AusweisApp", id: 948660805
mas "pCloud Pass", id: 1607974524


# ---- Communication ----

# Casks
cask "ferdium"
cask "thunderbird"
cask "signal"
cask "zoom"


# ---- Design ----

# Casks
cask "figma"
cask "obs"


# ---- Programming ----

# Formulae
brew "act" # To test run GitHub Actions locally
brew "ansible"
brew "deno"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "go"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "node"
brew "ollama"
brew "pnpm"
brew "pyenv"
brew "python@3.13"
brew "qemu"
brew "ruff"
brew "vim"

# Casks
cask "balenaetcher"
cask "cyberduck" # (S)FTP Client
cask "ghostty" # Terminal of Choice
cask "podman-desktop"
cask "utm"
cask "vagrant"
cask "virtualbox"
cask "zed"

# Apps
mas "Xcode", id: 497799835


# ---- Productivity ----

# Formulae
brew "pandoc"

# Casks
cask "obsidian"
cask "zotero"


# ---- Entertainment ----

# Casks
cask "vlc"
